app/controllers/reviews_controller.rb

  def create
    # binding.pry
    Review.create(create_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('TSSSS', 1, 'aaaaaaaa', 3, '2016-12-02 11:38:08', '2016-12-02 11:38:08')