app/views/products/show.html.erb

              <ul style="padding: 0">
                <% @product.reviews.each do |comment| %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1